20260124133259-bitwise_operators.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-31 Sat 14:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Bitwise Operators</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Bitwise Operators</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb295554">1. Bitwise Operators</a>
<ul>
<li><a href="#orgde22621">1.1. AND (&amp;)</a></li>
<li><a href="#org4317f3b">1.2. OR (|)</a></li>
<li><a href="#org5dea771">1.3. XOR (^)</a></li>
<li><a href="#org11a2885">1.4. NOT (~)</a></li>
<li><a href="#orgd12899f">1.5. Left Shift (&lt;&lt;)</a></li>
<li><a href="#orgad12743">1.6. Signed Right Shift (&gt;&gt;)</a></li>
<li><a href="#org1df22ea">1.7. Common Uses</a></li>
<li><a href="#orgeb6d3c2">1.8. Notes</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgb295554" class="outline-2">
<h2 id="orgb295554"><span class="section-number-2">1.</span> Bitwise Operators</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="20231231054220-bitwise_complement.html#ID-91190f03-3e70-4844-9a23-c50ca48da6b6">Bitwise Complement</a> <code>~</code> (<b>Only</b> applied to <a href="20231224104049-integer_data_types.html#ID-2483364b-73d3-4169-92b9-1fea473a9b01">Integer Data Types</a>)</li>
</ul>

<p>
Bitwise operators work directly on the <b>binary</b> representation of integer types <code>(byte, short, int, long, char)</code>.
They are commonly used for:
</p>
<ul class="org-ul">
<li>low-level programming</li>
<li>Performance Optimization</li>
<li>Bit manipulation.</li>
</ul>
</div>

<div id="outline-container-orgde22621" class="outline-3">
<h3 id="orgde22621"><span class="section-number-3">1.1.</span> AND (&amp;)</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Performs a bit-by-bit <code>AND</code> operation.</li>
<li>Result bit is 1 only if both corresponding bits are 1.</li>
</ul>

<div class="org-src-container">
<pre class="src src-java">int a = 5;   // 0101
int b = 3;   // 0011
int c = a &amp; b; // 0001 (1)
</pre>
</div>
</div>
</div>

<div id="outline-container-org4317f3b" class="outline-3">
<h3 id="org4317f3b"><span class="section-number-3">1.2.</span> OR (|)</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Performs a bit-by-bit <code>OR</code> operation.</li>
<li>Result bit is 1 if at least one corresponding bit is 1.</li>
</ul>

<div class="org-src-container">
<pre class="src src-java">int c = a | b; // 0111 (7)
</pre>
</div>
</div>
</div>

<div id="outline-container-org5dea771" class="outline-3">
<h3 id="org5dea771"><span class="section-number-3">1.3.</span> XOR (^)</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Performs a bit-by-bit exclusive OR.</li>
<li>Result bit is 1 if the bits are different.</li>
</ul>

<div class="org-src-container">
<pre class="src src-java">int c = a ^ b; // 0110 (6)
</pre>
</div>
</div>
</div>

<div id="outline-container-org11a2885" class="outline-3">
<h3 id="org11a2885"><span class="section-number-3">1.4.</span> NOT (~)</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Unary operator that inverts every bit.</li>
<li>Converts <code>1 → 0</code> and <code>0 → 1</code>.</li>
<li>Uses two's complement representation for signed integers.</li>
</ul>

<div class="org-src-container">
<pre class="src src-java">int a = 5;     // 00000000 00000000 00000000 00000101
int b = ~a;    // 11111111 11111111 11111111 11111010 (-6)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd12899f" class="outline-3">
<h3 id="orgd12899f"><span class="section-number-3">1.5.</span> Left Shift (&lt;&lt;)</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Shifts bits to the left.</li>
<li>Zeros are added on the right.</li>
<li>Effectively multiplies by 2 for each shift (when no overflow).</li>
</ul>

<div class="org-src-container">
<pre class="src src-java">int a = 3;      // 0011
int b = a &lt;&lt; 2; // 1100 (12)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgad12743" class="outline-3">
<h3 id="orgad12743"><span class="section-number-3">1.6.</span> Signed Right Shift (&gt;&gt;)</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>Shifts bits to the right.</li>
<li>Preserves the sign bit (arithmetic shift).</li>
<li>Fills with 0 for positive numbers, 1 for negative numbers.</li>
</ul>

<div class="org-src-container">
<pre class="src src-java">int a = -8;      // 11111000
int b = a &gt;&gt; 1;  // 11111100 (-4)
</pre>
</div>
</div>
</div>

<div id="outline-container-org1df22ea" class="outline-3">
<h3 id="org1df22ea"><span class="section-number-3">1.7.</span> Common Uses</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li>Bit masks and flags</li>
<li>Efficient arithmetic operations</li>
<li>Low-level data encoding/decoding</li>
<li>Permissions and feature toggles</li>
</ul>
</div>
</div>

<div id="outline-container-orgeb6d3c2" class="outline-3">
<h3 id="orgeb6d3c2"><span class="section-number-3">1.8.</span> Notes</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li>Shift distance is masked (only lower 5 bits used for int, 6 for long).</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
